In [ ]:
#Goal: Create a Dataframe that contains the following: 
###IMDB Movie ID
###Movie Title
###Domestig Gross
###Worldwide Gross
###Genres
###IMDB Rating
###IMDB Number of Votes

In [4]:
import pandas as pd
import numpy as np

In [114]:
##need: Domestic Gross, WorldWide Gross
##match on:: Movie Title
budget_df = pd.read_csv('data/tn.movie_budgets.csv.gz', header=0)
budget_df.rename(columns = {"movie": "primary_title"}, inplace = True)
budget_df.drop(columns = "production_budget", inplace = True)
budget_df

,id,release_date,primary_title,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$620,181,382","$1,316,721,747"
...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,$0,$0
5778,79,"Apr 2, 1999",Following,"$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$181,041","$181,041"

In [115]:
##need: Primary Title, Genres
##match on: tconst

imdb_titles_df = pd.read_csv('data/imdb.title.basics.csv.gz')
imdb_titles_df = imdb_titles_df.drop(columns = ["start_year", "runtime_minutes"])
imdb_titles_df

,tconst,primary_title,original_title,genres
0,tt0063540,Sunghursh,Sunghursh,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,"Comedy,Drama,Fantasy"
...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,Comedy
146142,tt9916730,6 Gunn,6 Gunn,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,Documentary

In [116]:
##need: Average Rating, Number of Votes
##match on: tconst
imdb_review_df = pd.read_csv('data/imdb.title.ratings.csv.gz')
imdb_review_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [130]:
Merged_IMDB_DF = imdb_titles_df.merge(imdb_review_df, how= 'right', on =  "tconst")

In [131]:
Merged_DF = Merged_IMDB_DF.merge(budget_df, how = 'right', on = "primary_title")
Merged_DF.dropna(subset = ["tconst", "primary_title"])

,tconst,primary_title,original_title,genres,averagerating,numvotes,id,release_date,domestic_gross,worldwide_gross
0,tt0249516,Foodfight!,Foodfight!,"Action,Animation,Comedy",1.9,8248.0,26,"Dec 31, 2012",$0,"$73,706"
1,tt0326592,The Overnight,The Overnight,NaN,7.5,24.0,21,"Jun 19, 2015","$1,109,808","$1,165,996"
2,tt3844362,The Overnight,The Overnight,"Comedy,Mystery",6.1,14828.0,21,"Jun 19, 2015","$1,109,808","$1,165,996"
3,tt0337692,On the Road,On the Road,"Adventure,Drama,Romance",6.1,37886.0,17,"Mar 22, 2013","$720,828","$9,313,302"
4,tt4339118,On the Road,On the Road,Drama,6.0,6.0,17,"Mar 22, 2013","$720,828","$9,313,302"
...,...,...,...,...,...,...,...,...,...,...
2870,tt8680254,Richard III,Richard III,Drama,9.1,28.0,65,"Dec 29, 1995","$2,684,904","$4,199,334"
2871,tt8824064,Heroes,Heroes,Documentary,7.3,7.0,12,"Oct 24, 2008","$655,538","$655,538"
2872,tt8976772,Push,Push,Documentary,7.3,33.0,70,"Feb 6, 2009","$31,811,527","$49,678,401"
2873,tt9024106,Unplanned,Unplanned,"Biography,Drama",6.3,5945.0,33,"Mar 29, 2019","$18,107,621","$18,107,621"
2874,tt9248762,The Terrorist,The Terrorist,Thriller,6.0,6.0,48,"Jan 14, 2000","$195,043","$195,043"